# Pandas

https://pandas.pydata.org/docs/user_guide/10min.html

In [3]:
!pip install pandas numpy -q

## Basic datas structure

**Series** 

a one-dimensional labeled array holding data of any type such as integers, strings, Python objects etc.

**DataFrame**

a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

In [7]:
import pandas as pd
import numpy as np

# Create series by passing a list
s = pd.Series([1,2,3,4,5,])

print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [20]:
# DataFrame creation with a dictionary of objects
# Note that some objects are created with Numpy & Pandas
df = pd.DataFrame(
    {
        # Value of A = 1.0 in all rows
        "A": 1.0,
        # Value of B = 2013-01-02 in all rows
        "B": pd.Timestamp("20130102"),
        # Value of C = [1,2,3,4,]
        "C": pd.Series([1,2,3,4,]),
        # Value of D = [3,3,3,3,]
        "D": np.array([3] * 4, dtype="int32"),
        # Value of E - categorical type
        "E": pd.Categorical(["test", "train", "test", "train"]),
        # Value of F = fixed to 'foo'
        "F": "foo",
    })
    
print(df)

print("-"*50)

# Print the types
print("Types:", df.dtypes)

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  2  3  train  foo
2  1.0 2013-01-02  3  3   test  foo
3  1.0 2013-01-02  4  3  train  foo
--------------------------------------------------
Types: A           float64
B    datetime64[ns]
C             int64
D             int32
E          category
F            object
dtype: object

In [13]:
np.array([3] * 4)

array([3, 3, 3, 3])

In [21]:
# print the sample

df.head()

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  2  3  train  foo
2  1.0 2013-01-02  3  3   test  foo
3  1.0 2013-01-02  4  3  train  foo

In [26]:
# Sort by index
df.sort_values(by='C', ascending=False)

     A          B  C  D      E    F
3  1.0 2013-01-02  4  3  train  foo
2  1.0 2013-01-02  3  3   test  foo
1  1.0 2013-01-02  2  3  train  foo
0  1.0 2013-01-02  1  3   test  foo

In [22]:
# Convert to numpy - ndarray type
df.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 2, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 3, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 4, 3, 'train', 'foo']],
      dtype=object)

In [23]:
# Checkout statistical summary
df.describe()

         A                    B         C    D
count  4.0                    4  4.000000  4.0
mean   1.0  2013-01-02 00:00:00  2.500000  3.0
min    1.0  2013-01-02 00:00:00  1.000000  3.0
25%    1.0  2013-01-02 00:00:00  1.750000  3.0
50%    1.0  2013-01-02 00:00:00  2.500000  3.0
75%    1.0  2013-01-02 00:00:00  3.250000  3.0
max    1.0  2013-01-02 00:00:00  4.000000  3.0
std    0.0                  NaN  1.290994  0.0

In [68]:
# Create a DF
df = pd.DataFrame(np.arange(12).reshape(3,4), columns=['A','B','C','D'])
print(df)

# axis{0 or ‘index’, 1 or ‘columns’}, default 0
df.drop(['C'], axis=1)

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

   A  B   D
0  0  1   3
1  4  5   7
2  8  9  11

# Selection

* You can use [:] operators like in numpy & lists
* Use label
* In addition there are multiple functions

https://pandas.pydata.org/docs/user_guide/10min.html#selection

# Pandas I/O

https://pandas.pydata.org/docs/user_guide/io.html

# Sample data
https://www.kaggle.com/datasets/ddosad/auto-sales-data

In [27]:
df = pd.read_csv("./data/auto-sales-data.csv")

df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,DAYS_SINCE_LASTORDER,STATUS,PRODUCTLINE,MSRP,PRODUCTCODE,CUSTOMERNAME,PHONE,ADDRESSLINE1,CITY,POSTALCODE,COUNTRY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,24/02/2018,828,Shipped,Motorcycles,95,S10_1678,Land of Toys Inc.,2125557818,897 Long Airport Avenue,NYC,10022,USA,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,07/05/2018,757,Shipped,Motorcycles,95,S10_1678,Reims Collectables,26.47.1555,59 rue de l'Abbaye,Reims,51100,France,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,01/07/2018,703,Shipped,Motorcycles,95,S10_1678,Lyon Souveniers,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,Paris,75508,France,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,25/08/2018,649,Shipped,Motorcycles,95,S10_1678,Toys4GrownUps.com,6265557265,78934 Hillside Dr.,Pasadena,90003,USA,Young,Julie,Medium
4,10168,36,96.66,1,3479.76,28/10/2018,586,Shipped,Motorcycles,95,S10_1678,Technics Stores Inc.,6505556809,9408 Furth Circle,Burlingame,94217,USA,Hirano,Juri,Medium

## loc

Access a group of rows and columns by label(s) or a boolean array.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html

In [43]:
# Access all rows specified by ':' and just 2 columns
df.loc[:,['ORDERNUMBER', 'QUANTITYORDERED']].head()

   ORDERNUMBER  QUANTITYORDERED
0        10107               30
1        10121               34
2        10134               41
3        10145               45
4        10168               36

In [45]:
# Access row 1 through 3
df.loc[1:3,['ORDERNUMBER', 'QUANTITYORDERED']].head()

   ORDERNUMBER  QUANTITYORDERED
1        10121               34
2        10134               41
3        10145               45

In [49]:
# Access data in the column
df['QUANTITYORDERED']

0       30
1       34
2       41
3       45
4       36
        ..
2742    20
2743    29
2744    43
2745    34
2746    47
Name: QUANTITYORDERED, Length: 2747, dtype: int64

In [60]:
# Access only those rows for which the QUANTITYORDERED > 50
df1 = df.loc[(df['QUANTITYORDERED'] > 80)]

print("count=", df1.size)
print(df1)

count= 40
      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
399         10405               97      93.28                5  9048.16
2511        10401               85      88.75               10  7543.75

       ORDERDATE  DAYS_SINCE_LASTORDER   STATUS   PRODUCTLINE  MSRP  \
399   14/04/2020                   447  Shipped  Classic Cars   115
2511  03/04/2020                  2570  On Hold        Planes    99

     PRODUCTCODE             CUSTOMERNAME       PHONE      ADDRESSLINE1  \
399     S12_4675              Mini Caravy  88.60.1555  24, place Kluber
2511   S700_2466  Tekni Collectables Inc.  2015559350     7476 Moss Rd.

            CITY POSTALCODE COUNTRY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
399   Strasbourg      67000  France         Citeaux       Frederique    Large
2511      Newark      94019     USA           Brown          William    Large

0       30
1       34
2       41
3       45
4       36
        ..
2742    20
2743    29
2744    43
2745    34
2746    47
Name: QUANTITYORDERED, Length: 2747, dtype: int64